In [1]:
import pandas as pd

capacities = pd.DataFrame(
    [["seattle", 350], ["san-diego", 600]], columns=["city", "capacity"]
).set_index("city")

capacities

           capacity
city
seattle         350
san-diego       600

In [2]:
demands = pd.DataFrame(
    [["new-york", 325], ["chicago", 300], ["topeka", 275]], columns=["city", "demand"]
).set_index("city")

demands

          demand
city
new-york     325
chicago      300
topeka       275

In [3]:
distances = pd.DataFrame(
    [
        ["seattle", "new-york", 2.5],
        ["seattle", "chicago", 1.7],
        ["seattle", "topeka", 1.8],
        ["san-diego", "new-york", 2.5],
        ["san-diego", "chicago", 1.8],
        ["san-diego", "topeka", 1.4],
    ],
    columns=["from", "to", "distance"],
).set_index(["from", "to"])

distances

                    distance
from      to
seattle   new-york       2.5
          chicago        1.7
          topeka         1.8
san-diego new-york       2.5
          chicago        1.8
          topeka         1.4

In [4]:
freight_cost = 90

In [5]:
from gamspy import Container, Set, Parameter, Variable, Equation, Model, Sum, Sense

In [6]:
m = Container()

In [7]:
i = Set(container=m, name="i", description="plants")
i.setRecords(capacities.index)

In [8]:
j = Set(container=m, name="j", description="markets", records=demands.index)

In [9]:
i.records

         uni element_text
0    seattle
1  san-diego

In [10]:
j.records

        uni element_text
0  new-york
1   chicago
2    topeka

In [11]:
a = Parameter(
    container=m,
    name="a",
    domain=i,
    description="supply of commodity at plant i (in cases)",
    records=capacities.reset_index(),
)
a.records

        city  value
0    seattle  350.0
1  san-diego  600.0

In [12]:
b = Parameter(
    container=m,
    name="b",
    domain=j,
    description="demand for commodity at market j (in cases)",
    records=demands.reset_index(),
)
b.records

       city  value
0  new-york  325.0
1   chicago  300.0
2    topeka  275.0

In [13]:
c = Parameter(
    container=m,
    name="c",
    domain=[i, j],
    description="cost per unit of shipment between plant i and market j",
)

In [14]:
cost = freight_cost * distances / 1000
cost

                    distance
from      to
seattle   new-york     0.225
          chicago      0.153
          topeka       0.162
san-diego new-york     0.225
          chicago      0.162
          topeka       0.126

In [15]:
c.setRecords(cost.reset_index())
c.records

        from        to  value
0    seattle  new-york  0.225
1    seattle   chicago  0.153
2    seattle    topeka  0.162
3  san-diego  new-york  0.225
4  san-diego   chicago  0.162
5  san-diego    topeka  0.126

In [16]:
d = Parameter(
    container=m,
    name="d",
    domain=[i, j],
    description="distance between plant i and market j",
    records=distances.reset_index(),
)
d.records

        from        to  value
0    seattle  new-york    2.5
1    seattle   chicago    1.7
2    seattle    topeka    1.8
3  san-diego  new-york    2.5
4  san-diego   chicago    1.8
5  san-diego    topeka    1.4

In [17]:
c[i, j] = freight_cost * d[i, j] / 1000
c.records

           i         j  value
0    seattle  new-york  0.225
1    seattle   chicago  0.153
2    seattle    topeka  0.162
3  san-diego  new-york  0.225
4  san-diego   chicago  0.162
5  san-diego    topeka  0.126

In [18]:
x = Variable(
    container=m,
    name="x",
    domain=[i, j],
    type="Positive",
    description="amount of commodity to ship from plant i to market j",
)

In [19]:
supply = Equation(
    container=m, name="supply", domain=i, description="observe supply limit at plant i"
)
demand = Equation(
    container=m, name="demand", domain=j, description="satisfy demand at market j"
)

In [20]:
supply[i] = Sum(j, x[i, j]) <= a[i]

In [21]:
demand[j] = Sum(i, x[i, j]) >= b[j]

In [22]:
obj = Sum((i, j), c[i, j] * x[i, j])

In [23]:
transport = Model(
    m,
    name="transport",
    equations=[supply, demand],
    problem="LP",
    sense=Sense.MIN,
    objective=obj,
)

In [24]:
transport_2 = Model(
    m,
    name="transport2",
    equations=m.getEquations(),
    problem="LP",
    sense=Sense.MIN,
    objective=obj,
)

In [25]:
import sys

transport.solve(output=sys.stdout)

--- Job _job_9b92eceb-09ed-42d9-bc9a-45c1ce8f249a.gms Start 11/28/23 17:31:22 45.3.0 c4c31d8a WEX-WEI x86 64bit/MS Windows
--- Applying:
    C:\Users\lequo\AppData\Local\Programs\Python\Python312\Lib\site-packages\gamspy_base\gmsprmNT.txt
--- GAMS Parameters defined
    LP CPLEX
    MIP CPLEX
    RMIP CPLEX
    NLP CONOPT
    MCP PATH
    MPEC NLPEC
    RMPEC CONVERT
    CNS CONOPT
    DNLP CONOPT
    RMINLP CONOPT
    MINLP SBB
    QCP CONOPT
    MIQCP SBB
    RMIQCP CONOPT
    EMP CONVERT
    Restart C:\Users\lequo\AppData\Local\Temp\tmpg64bw_zd\_save_695e8aef-4882-4543-9c89-77fc727cfe1a.g00
    Input C:\Users\lequo\AppData\Local\Temp\tmpg64bw_zd\_job_9b92eceb-09ed-42d9-bc9a-45c1ce8f249a.gms
    Output C:\Users\lequo\AppData\Local\Temp\tmpg64bw_zd\_job_9b92eceb-09ed-42d9-bc9a-45c1ce8f249a.lst
    Save C:\Users\lequo\AppData\Local\Temp\tmpg64bw_zd\_restart_695e8aef-4882-4543-9c89-77fc727cfe1a.g00
    ScrDir C:\Users\lequo\AppData\Local\Temp\tmpg64bw_zd\225a\
    SysDir C:\Users\lequo\AppData\Local\Programs\Python\Python312\Lib\site-packages\gamspy_base\
    CurDir C:\Users\lequo\AppData\Local\Temp\tmpg64bw_zd\
    LogOption 3
    LogFile C:\Users\lequo\AppData\Local\Temp\tmpg64bw_zd\_job_9b92eceb-09ed-42d9-bc9a-45c1ce8f249a.log
Licensee: GAMS Demo, for EULA and demo limitations see   G230930/0001CB-GEN
          https://www.gams.com/latest/docs/UG%5FLicense.html         DC0000
          C:\Users\lequo\AppData\Local\Programs\Python\Python312\Lib\site-packages\gamspy_base\gamslice.txt
          Demo license for demonstration and instructional purposes only
Processor information: 1 socket(s), 4 core(s), and 8 thread(s) available
GAMS 45.3.0   Copyright (C) 1987-2023 GAMS Development. All rights reserved
--- Starting continued compilation
--- Workfile was generated under GAMS version WEX453-453
--- _job_9b92eceb-09ed-42d9-bc9a-45c1ce8f249a.gms(3) 3 Mb
--- GDXin=C:\Users\lequo\AppData\Local\Temp\tmpg64bw_zd\_gdx_in_695e8aef-4882-4543-9c89-77fc727cfe1a.gdx
--- GDX File ($gdxIn) C:\Users\lequo\AppData\Local\Temp\tmpg64bw_zd\_gdx_in_695e8aef-4882-4543-9c89-77fc727cfe1a.gdx
--- _job_9b92eceb-09ed-42d9-bc9a-45c1ce8f249a.gms(115) 3 Mb
--- Starting execution: elapsed 0:00:00.020
--- Generating LP model transport
--- _job_9b92eceb-09ed-42d9-bc9a-45c1ce8f249a.gms(43) 4 Mb
---   6 rows  7 columns  19 non-zeroes
--- Range statistics (absolute non-zero finite values)
--- RHS       [min, max] : [ 2.750E+02, 6.000E+02] - Zero values observed as well
--- Bound     [min, max] : [        NA,        NA] - Zero values observed as well
--- Matrix    [min, max] : [ 1.260E-01, 1.000E+00]
--- Executing CPLEX (Solvelink=2): elapsed 0:00:00.979

IBM ILOG CPLEX   45.3.0 c4c31d8a Nov 11, 2023          WEI x86 64bit/MS Window

*** This solver runs with a demo license. No commercial use.
--- GMO setup time: 0.00s
--- GMO memory 0.50 Mb (peak 0.50 Mb)
--- Dictionary memory 0.00 Mb
--- Cplex 22.1.1.0 link memory 0.00 Mb (peak 0.00 Mb)
--- Starting Cplex

Version identifier: 22.1.1.0 | 2022-11-27 | 9160aff4d
CPXPARAM_Advance                                 0
CPXPARAM_Simplex_Display                         2
CPXPARAM_Threads                                 1
CPXPARAM_MIP_Display                             4
CPXPARAM_MIP_Pool_Capacity                       0
CPXPARAM_MIP_Tolerances_AbsMIPGap                0
Tried aggregator 1 time.
LP Presolve eliminated 0 rows and 1 columns.
Reduced LP has 5 rows, 6 columns, and 12 nonzeros.
Presolve time = 0.00 sec. (0.00 ticks)

Iteration      Dual Objective            In Variable           Out Variable
     1              73.125000    x(seattle,new-york) demand(new-york) slack
     2             119.025000     x(seattle,chicago)  demand(chicago) slack
     3             153.675000    x(san-diego,topeka)   demand(topeka) slack
     4             153.675000  x(san-diego,new-york)  supply(seattle) slack

--- LP status (1): optimal.
--- Cplex Time: 0.00sec (det. 0.01 ticks)


Optimal solution found
Objective:          153.675000

--- Reading solution for model transport
--- Executing after solve: elapsed 0:00:03.042
--- _job_9b92eceb-09ed-42d9-bc9a-45c1ce8f249a.gms(134) 4 Mb
--- GDX File (execute_unload) C:\Users\lequo\AppData\Local\Temp\tmpg64bw_zd\_gdx_out_695e8aef-4882-4543-9c89-77fc727cfe1a.gdx
*** Status: Normal completion
--- Job _job_9b92eceb-09ed-42d9-bc9a-45c1ce8f249a.gms Stop 11/28/23 17:31:25 elapsed 0:00:03.045

In [26]:
x.records.set_index(["i", "j"])

                    level  marginal  lower  upper  scale
i         j
seattle   new-york   50.0     0.000    0.0    inf    1.0
          chicago   300.0     0.000    0.0    inf    1.0
          topeka      0.0     0.036    0.0    inf    1.0
san-diego new-york  275.0     0.000    0.0    inf    1.0
          chicago     0.0     0.009    0.0    inf    1.0
          topeka    275.0     0.000    0.0    inf    1.0

In [27]:
transport.objective_value

153.675